---
kind: method
id: M:Autodesk.Revit.DB.Form.IsEndFace(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/67c79458-4ea0-ae6a-4e8c-2cd18b32dfd4.htm
---
# Autodesk.Revit.DB.Form.IsEndFace Method

**中文**: 对话框、窗口、窗体

Given a face, tell if it is an end cap face.

## Syntax (C#)
```csharp
public bool IsEndFace(
	Reference faceReference
)
```

## Parameters
- **faceReference** (`Autodesk.Revit.DB.Reference`) - The reference of the face to be checked.